Tekla Open API Reference for Tekla Structures 2025
ChangeData.Type Property
 Gets the change type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ChangeData.ChangeTypeEnum Type { get; }
Public ReadOnly Property Type As ChangeData.ChangeTypeEnum
	Get
Property Value
Type: ChangeData.ChangeTypeEnum
See Also
Reference
ChangeData Class
Tekla.Structures.Model Namespace